pages/7_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>An Introduction to Mechanisms</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">An Introduction to Mechanisms</h1>
<div class="github-fork-ribbon-wrapper left">
        <div class="github-fork-ribbon">
            <a href="https://github.com/MarcScott/7-SC-Mechanisms">Fork me on GitHub</a>
        </div>
    </div>
    <div class="github-fork-ribbon-wrapper right-bottom">
        <div class="github-fork-ribbon">
            <a href="../index.html">Back to Index</a>
        </div>
    </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Making your automata - 2D Design</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To make your own automata using <b>2D Design</b> there are a munber of skills that you need to 
be able to do.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3 badge">
<h3 id="sec-1-2">Learn It - Drawing boundary boxes</h3>
<div class="outline-text-3" id="text-1-2">

<ul class="org-ul">
<li>On the side bar, click and hold one line tool and select the third option ‘given angle and length’.
</li>
<li>Type in the numbers you need. For example – 106mm by 0 degrees and 25mm by 90 degrees.
</li>
<li>Below is a video to help.
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/imPdqbJcGqk" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3 badge">
<h3 id="sec-1-3">Learn It - Find suitable images online</h3>
<div class="outline-text-3" id="text-1-3">

<ul class="org-ul">
<li>Go to the website www.google.co.uk , type in what you want an image of. 
</li>
<li>Click on images – tools – black and white – clipart
</li>
<li>Find a good image – remember the laser cutter only works in one colour so keep the images simple.
</li>
<li>Right click - Copy and paste into 2D design.
</li>
<li><b>Please note</b> - not all images will work. Just keep trying until you get one that works. 
</li>
<li>Below is a video to help.
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/d17t_iy3n7g" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3 badge">
<h3 id="sec-1-4">Learn It - Scale</h3>
<div class="outline-text-3" id="text-1-4">

<ul class="org-ul">
<li>By clicking shift and then dragging a corner of the image you will maintain the images overall proportions i.e. it won’t be squashed or stretched.
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/DMxDlTx5tFw" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3 badge">
<h3 id="sec-1-5">Learn It - Vectorise the image</h3>
<div class="outline-text-3" id="text-1-5">

<ul class="org-ul">
<li>At the top, go to Bitmaps &gt; Vectorise Bitmap. Monochrome. OK. OK.
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/C1fCxMG_wQY" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3 badge">
<h3 id="sec-1-6">Learn It - Contour</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>On the side toolbar, click on the Contour tool &gt; spacing 0.00mm. Select red colour. Click on the outside of the image.
</li>
<li>Then move the contour layer away from the original image by dragging with the mouse.
</li>

<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/v1xIDcnJOpA" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3 badge">
<h3 id="sec-1-7">Learn It - Holes for cutting</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>On the side toolbar click on the circle tool – select the second option with an ‘R’. Change to 1.5mm.
</li>
<li>Click where you want the hole to be.
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/-qGKmhh3V3c" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3 badge">
<h3 id="sec-1-8">Learn It - Measuring using the dimension tool</h3>
<div class="outline-text-3" id="text-1-8">

<ul class="org-ul">
<li>On the side toolbar, click on the dim lines tool. You need to draw a horizontal or vertical line, or both, on the object you want measuring. If you select the object and the dim lines, hold shift, you can resize objects with some accuracy.
</li>
<li><b>Please note:</b> You will need to delete these lines when you have finished drawing otherwise they will be included in the cut.
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/tCrKIf2MbrI" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3 badge">
<h3 id="sec-1-9">Learn It - Adding Text</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>From the side toolbar select the text tool. Click where you want to add text.
</li>
<li>Type your message then go to Settings to change the font size and type.
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/3ferVsXF9rc" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3 badge">
<h3 id="sec-1-10">Learn It - Email to the lasercutter</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>Firstly make sure your file is saved with a suitable name. Then go to Outlook – should be a link on the bottom toolbar in Windows – big O. Click on new. Type the address lasercutter and then check names. Attach the file and send it. 
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/iQgy7vNHvZM" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3 badge">
<h3 id="sec-1-11">Learn It - A worked example</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Here is a worked example from start to finish. Please note: the sound and images are sometimes not in sync. 
</li>
</ul>
<p>
&lt;old video&gt;
</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/85taO_TI1Rw" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3 badge">
<h3 id="sec-1-12">Badge It - Silver, Gold and Platinum</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>For silver add screenshots of your new parts.
</li>
<li>For gold add a cutting sheet
</li>
<li>For platinum, upload a photo of your finished automata.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
